"""Написать регулярное выражение, определяющее является ли данная строчка датой в формате dd/mm/yyyy.
Начиная с 1600 года до 9999 года.
– пример правильных выражений: 29/02/2000, 30/04/2003, 01/01/2003.
– пример неправильных выражений: 29/02/2001, 30-04-2003, 1/1/1899.
"""

import re
date_reg = r"^(?:0[1-9]|[12][0-9]|3[01])/(?:0[1-9]|1[0-2])/(?:16|[12][0-9]{3}|3[0-9]{3}|[4-9][0-9]{3})$"
def validate_date(date_str):
    if re.match(date_reg, date_str):
        return True
    else:
        return False
# Примеры 
check = [
    "29/02/2000",  
    "30/04/2003",  
    "01/01/2003",  
    "29/02/2001",  
    "30-04-2003",  
    "1/1/1899",     
    "31/04/2024",   
]
for date in check:
    print(f"{date}: {'Корректно' if validate_date(date) else 'Некорректно'}")
